USE library_borrow_system;

-- 初始資料

-- 10本書籍資料
INSERT INTO books (isbn, name, author, introduction) VALUES 
('9789863479114', 'Clean Code 敏捷開發聖經', 'Robert C. Martin', '程式碼潔癖必讀！深入探討如何寫出好維護、好閱讀、無臭味的頂級程式碼。'),
('9789865024567', 'Spring Boot 實戰指南', 'Craig Walls', '全方位打通 Spring Boot 核心技術，從 MVC、Data JPA 到資安防禦一網打盡。'),
('9789571234561', 'Java 預存程序高級實戰', 'Marco', '深入探討如何利用預存程序與 Spring 技術完美結合，打造銀行級高效能後端。'),
('9789571234562', 'Vue 3 關注點分離密技', 'Pan', '前端大師親自傳授，解構精美 UI 自動化與前端 HTML、CSS、JS 的拆分藝術。'),
('9789865021111', '重構：改善既有程式的設計', 'Martin Fowler', '軟體工程師進階必讀！教你如何在不改變外部行為的前提下，優化既有代碼結構。'),
('9789572223334', 'SQL 效能調校聖經', 'Lin', '從底層 B-Tree 索引結構到預存程序邏輯優化，DBA 與後端開發者的效能救星。'),
('9789864761234', '設計模式：可復用物件導向軟體的基礎', 'Erich Gamma', '經典的 GoF 23 種設計模式，培養頂級物件導向抽象思考與解耦能力的必備工具書。'),
('9789865028888', '演算法圖鑑：最佳視覺化演算法指南', '石田保輝', '用最直覺的圖解，帶你秒懂排序、搜尋、圖形理論等核心演算法與資料結構。'),
('9789571112223', 'Git 版本控制實戰養成', '高見龍', '救夫聖經！深入淺出帶你收服 Git 機制，從此再也不怕 Commit 衝突與分支打結。'),
('9789864765555', '深入淺出 Java 程式設計', 'Kathy Sierra', '最受歡迎的 Java 入門經典，用幽默風趣的圖解與互動，幫你快速無痛打好 Java 底子。');


-- 對應書籍庫存表
INSERT INTO inventory (isbn, status) VALUES 
('9789863479114', '在庫'),
('9789865024567', '出借中'),
('9789571234561', '整理中'),
('9789571234562', '遺失'),
('9789865021111', '損毀'),
('9789572223334', '廢棄'),
('9789864761234', '在庫'),
('9789865028888', '在庫'),
('9789571112223', '在庫'),
('9789864765555', '在庫');
